import pandas as pd
from matplotlib import pyplot as plt

df = pd.read_csv('./diabetes.csv')

# 결측값 측정
print(df.isnull().any())
# 모두 False 이나 결측값은 있다

print(df.describe())
"""
 Pregnancies     Glucose  BloodPressure  SkinThickness     Insulin         BMI  DiabetesPedigreeFunction         Age     Outcome
count   768.000000  768.000000     768.000000     768.000000  768.000000  768.000000                768.000000  768.000000  768.000000
mean      3.845052  120.894531      69.105469      20.536458   79.799479   31.992578                  0.471876   33.240885    0.348958
std       3.369578   31.972618      19.355807      15.952218  115.244002    7.884160                  0.331329   11.760232    0.476951
min       0.000000    0.000000       0.000000       0.000000    0.000000    0.000000                  0.078000   21.000000    0.000000
25%       1.000000   99.000000      62.000000       0.000000    0.000000   27.300000                  0.243750   24.000000    0.000000
50%       3.000000  117.000000      72.000000      23.000000   30.500000   32.000000                  0.372500   29.000000    0.000000
75%       6.000000  140.250000      80.000000      32.000000  127.250000   36.600000                  0.626250   41.000000    1.000000
max      17.000000  199.000000     122.000000      99.000000  846.000000   67.100000                  2.420000   81.000000    1.000000

몇몇 수치의 min 값이 0 인데 실질적으로 측정했을 때 0이 나올 순 없다!
그니까 0이 바로 결측값!
"""

# 각 col 마다 0이 몇갠지 세보자
print('Number of rows with 0 values for each variable')
for col in df.columns:
    # col에 해당하는 value 가 0인 행의 갯수 리턴! shape[0] 은 3 by 4  라 하면 3 리턴
    missing_rows = df.loc[df[col] == 0].shape[0]
    print(col + ": " + str(missing_rows))
